import math

# Параметри
m = 9
a = 0 #Лівий інтеграм
b = 0.5 #Правий інтеграл
h = 0.005 #Крок
d = 0.001 #Похибка

# Функція для обчислення члена ряду
def term(m, n, x): # Функція з аргументами
    product = (-1)**n  # Обчислюємо (-1)^n для зміни знака
    for i in range(n):  # Обчислюємо добуток m * (m+1) * ... * (m+n-1)
        product *= (m + i) 
    return product * x**n / math.factorial(n)  # Член ряду

# Функція для табулювання ряду
def tabulate_series(m, a, b, h, d):
    x = a  # Табулювання починається з початкового значення
    while x <= b:
        sum_series = 1  # Початкове значення суми
        n = 1 # Починається з 1 і збільшується з кожним обчисленням 
        while True: # Нескінченний цикл
            next_term = term(m, n, x)  # Обчислення наступного ряду
            if abs(next_term) < d:  # Перевірка похибки
                break  # Зупинення додавання, якщо похибка менша за d
            sum_series += next_term
            n += 1 # Перехід до наступного члена ряду
        print(f"x = {x:.3f}, f(x) = {sum_series:.6f}")
        x += h  # До наступного значення x

# Виконування табулювання
tabulate_series(m, a, b, h, d)